Enums/КатегорииНачисленийИНеоплаченногоВремени.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>КатегорииНачисленийИНеоплаченногоВремени</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПовременнаяОплатаТруда</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СдельнаяОплатаТруда</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаТрудаВНатуральнойФорме</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоходВНатуральнойФорме</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КомпенсационныеВыплаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Премия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РайонныйКоэффициент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СевернаяНадбавка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДенежноеСодержаниеКомпенсацияОтпуска</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДенежноеСодержаниеНаПериодКомандировки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДенежноеСодержаниеНаПериодОтпуска</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаОтпуска</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КомпенсацияОтпуска</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЕдиновременнаяВыплатаКОтпускуГосслужащего</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЕдиновременнаяВыплатаКОтпуску</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МатериальнаяПомощьПриОтпускеГосслужащего</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МатериальнаяПомощьПриОтпуске</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтпускБезОплаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеявкаПоНевыясненнымПричинам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прогул</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПростойВСвязиСПриостановкойТрудовогоДоговора</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПростойПоВинеРаботника</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаПростояПоВинеРаботодателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаПростояПоНезависящимОтРаботодателяПричинам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаКомандировки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СохраняемоеДенежноеСодержание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаПоСреднемуЗаработку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоплатаДоСреднегоЗаработка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтпускПоБеременностиИРодам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаБольничногоЛиста</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаБольничногоЛистаЗаСчетРаботодателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаБольничногоПрофзаболевание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаБольничногоНесчастныйСлучайНаПроизводстве</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоплатаДоСреднегоЗаработкаЗаДниБолезни</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаДнейУходаЗаДетьмиИнвалидами</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПособиеПоУходуЗаРебенкомДоПолутораЛет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПособиеПоУходуЗаРебенкомДоТрехЛет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыходноеПособиеМесячноеДенежноеСодержание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыходноеПособие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоплатаЗаСовмещение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БолезньБезОплаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтпускПоБеременностиИРодамБезОплаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаработокНаВремяТрудоустройства</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МатериальнаяПомощь</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Льгота</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НадбавкаЗаВредность</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтпускНаСанаторноКурортноеЛечение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отгул</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаПредыдущимиДокументами</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоплатаДоДенежногоСодержанияЗаДниБолезни</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Индексация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоплатаДоМЗП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МобилизацияБезОплаты</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ПричиныНетрудоспособности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ПричиныНетрудоспособности</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОбщееЗаболевание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоБеременностиИРодам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТравмаНаПроизводстве</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Профзаболевание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоУходуЗаРебенком</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоУходуЗаРебенкомВслучаеБолезниУхаживающегоЛица</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоУходуЗаВзрослым</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Карантин</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Протезирование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПособиеПриДолечивании</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаболеваниеЧернобыльцев</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НепроизводственныеТравмы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СанаторноКурортноеЛечение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>COVID_19</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыОбязательногоСтрахованияСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ВидыОбязательногоСтрахованияСотрудников</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ФССНесчастныеСлучаи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФСС</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ПереченьПособийСоциальногоСтрахования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ПереченьПособийСоциальногоСтрахования</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Нетрудоспособность</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БеременностьРоды</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриРожденииРебенка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриПостановкеНаУчетВРанниеСрокиБеременности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВСвязиСоСмертью</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДополнительныеВыходныеДниПоУходуЗаДетьмиИнвалидами</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НетрудоспособностьНесчастныйСлучай</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НетрудоспособностьПрофзаболевание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДополнительныйОтпускПослеНесчастныхСлучаев</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоУходуЗаРебенком</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтраховыеВзносыПоДопВыходнымПоУходуЗаДетьмиИнвалидами</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/ПрямыеВыплатыПособийСоциальногоСтрахованияРасширенный/Ext/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

Процедура ЗаполнитьПризнакВыплачиваетсяФСССуществующихДокументов(МенеджерВременныхТаблиц) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОтпускПоУходуЗаРебенком.Ссылка
	|ИЗ
	|	Документ.ОтпускПоУходуЗаРебенком КАК ОтпускПоУходуЗаРебенком
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТДатыПередачиВыплатыПособий КАК ВТДатыПередачиВыплатыПособий
	|		ПО ОтпускПоУходуЗаРебенком.Организация = ВТДатыПередачиВыплатыПособий.Организация
	|			И (ВТДатыПередачиВыплатыПособий.Дата МЕЖДУ ОтпускПоУходуЗаРебенком.ДатаНачала И ОтпускПоУходуЗаРебенком.ДатаОкончания)
	|			И (ОтпускПоУходуЗаРебенком.ПособиеВыплачиваетсяФСС = ЛОЖЬ)";
	
	Результат = Запрос.Выполнить();
	
	Если Не Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			Документ = Выборка.Ссылка.ПолучитьОбъект();
			Документ.ОбменДанными.Загрузка = Истина;
			
			Документ.ПособиеВыплачиваетсяФСС = Истина;
			
			Документ.Записать(РежимЗаписиДокумента.Запись);
		КонецЦикла;	
	КонецЕсли;
	
КонецПроцедуры

// Функция - Категории начислений пособий по прямым выплатам ФСС
// 
// Возвращаемое значение:
//  МассивКатегорий - Массив, категории пособий, которые оплачиваются напрямую ФСС
//
Функция КатегорииНачисленийПособийПоПрямымВыплатамФСС() Экспорт
	
	МассивКатегорий = Новый Массив;
	МассивКатегорий.Добавить(Перечисления.КатегорииНачисленийИНеоплаченногоВремени.ОплатаБольничногоЛиста);
	МассивКатегорий.Добавить(Перечисления.КатегорииНачисленийИНеоплаченногоВремени.ОплатаБольничногоНесчастныйСлучайНаПроизводстве);
	МассивКатегорий.Добавить(Перечисления.КатегорииНачисленийИНеоплаченногоВремени.ОплатаБольничногоПрофзаболевание);
	МассивКатегорий.Добавить(Перечисления.КатегорииНачисленийИНеоплаченногоВремени.ОтпускПоБеременностиИРодам);
	МассивКатегорий.Добавить(Перечисления.КатегорииНачисленийИНеоплаченногоВремени.ПособиеПоУходуЗаРебенкомДоПолутораЛет);
		
	Возврат МассивКатегорий;	
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ЗаявлениеРасчетВФСС

Функция ДанныеЗаполненияЗаявленияВФССОВозмещенииВыплатРодителямДетейИнвалидов(Месяц, ФСС, Организация, СписокСотрудников ,Ссылка, ОплатаДнейУходаЗаДетьмиИнвалидами = Неопределено,РежимЗаполнения) Экспорт
	
	СписокПричин = Новый СписокЗначений;
	Если Месяц < Дата(2018,10,1) Тогда
		СписокПричин.Добавить(Перечисления.ПричиныНетрудоспособности.Профзаболевание);
		СписокПричин.Добавить(Перечисления.ПричиныНетрудоспособности.ТравмаНаПроизводстве);
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Текст = ТекстЗапросаПервичныеДокументыДляЗаполненияЗаявленияВФССОВозмещенииВыплатРодителямДетейИнвалидов(ОплатаДнейУходаЗаДетьмиИнвалидами, ФСС, СписокСотрудников);
	Текст = Текст +
	"
	|; 
	|";
	
	Текст = Текст +
	"ВЫБРАТЬ
	|	БольничныйЛист.Сотрудник КАК Сотрудник,
	|	БольничныйЛист.НачисленоФСС+БольничныйЛист.НачисленоРаботодатель КАК СуммаПособия,
	|	БольничныйЛист.Ссылка КАК ДокументОснование,
	|	1 КАК КоличествоСтраниц,
	|	БольничныйЛист.ПричинаНетрудоспособности,
	|	БольничныйЛист.ДнейОплаты КАК КоличествоДнейВсего,
	|	БольничныйЛист.ДнейОплатыЗаСчетФСС КАК КоличествоДнейВсегоФСС,
	|	БольничныйЛист.СуммаЧернобыльскойЛьготы КАК СуммаЛьготыЧернобыльцы,
	|	БольничныйЛист.НомерЛисткаНетрудоспособности КАК НомерБольничного,
	|	БольничныйЛист.ДатаНачала КАК ПериодС,
	|	БольничныйЛист.ДатаОкончания КАК ПериодПо,
	|	БольничныйЛист.НачисленоФСС+БольничныйЛист.НачисленоРаботодатель КАК СуммаПособияВсего,
	|	БольничныйЛист.НачисленоФСС КАК СуммаПособияВсегоФСС
	|ИЗ
	|	Документ.БольничныйЛист КАК БольничныйЛист
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТДокументы КАК ВТДокументы
	|		ПО БольничныйЛист.Ссылка = ВТДокументы.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Сотрудник";
	
	
	
	Запрос.Текст = Текст;
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ГруппаУчета", Справочники.ГруппыУчетаНачисленийИУдержаний.НачисленияФСС);
	Запрос.УстановитьПараметр("ДокументОснование", ОплатаДнейУходаЗаДетьмиИнвалидами);
	Запрос.УстановитьПараметр("ПричинаНетрудоспособности", СписокПричин);
	Запрос.УстановитьПараметр("ДатаСобытия", Месяц);
	Запрос.УстановитьПараметр("СписокСотрудников", СписокСотрудников);
	Запрос.УстановитьПараметр("РежимЗаполнения", РежимЗаполнения);
	
	Возврат Запрос.Выполнить();
	
КонецФункции 

Функция ТекстЗапросаПервичныеДокументыДляЗаполненияЗаявленияВФССОВозмещенииВыплатРодителямДетейИнвалидов(ОплатаДнейУходаЗаДетьмиИнвалидами = Неопределено, ФСС, СписокСотрудников)
	
	Если ЗначениеЗаполнено(ОплатаДнейУходаЗаДетьмиИнвалидами) Тогда
		Текст =
		"ВЫБРАТЬ
		|	БольничныйЛист.Ссылка
		|ПОМЕСТИТЬ ВТДокументы
		|ИЗ
		|	Документ.БольничныйЛист КАК БольничныйЛист
		|ГДЕ
		|	БольничныйЛист.Ссылка = &ДокументОснование";
	Иначе
		Текст = 
		"ВЫБРАТЬ
		|	ИспользованныеОплаты.ДокументОснование КАК Ссылка
		|ПОМЕСТИТЬ ВТИспользованныеОплаты
		|ИЗ
		|	Документ.ЗаявлениеРасчетВФСС.Оплаты КАК ИспользованныеОплаты
		|ГДЕ
		|	ИспользованныеОплаты.Ссылка.Организация = &Организация
		|	И ИспользованныеОплаты.Ссылка <> &Ссылка
		|	И ИспользованныеОплаты.Ссылка.Проведен = ИСТИНА
		|	И НЕ ИспользованныеОплаты.Ссылка.ПометкаУдаления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	БольничныйЛист.Ссылка
		|ПОМЕСТИТЬ ВТДокументы
		|ИЗ
		|	Документ.БольничныйЛист КАК БольничныйЛист
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТИспользованныеОплаты КАК ВТИспользованныеОплаты
		|		ПО БольничныйЛист.Ссылка = ВТИспользованныеОплаты.Ссылка
		|ГДЕ
		|	БольничныйЛист.Организация = &Организация
		|	И БольничныйЛист.НачисленоФСС >0
		|	И БольничныйЛист.ДнейОплатыЗаСчетФСС >0
		|	И ВТИспользованныеОплаты.Ссылка ЕСТЬ NULL 
		|	И БольничныйЛист.ПометкаУдаления = ЛОЖЬ
		|	И БольничныйЛист.Проведен = ИСТИНА
		|	И БольничныйЛист.ПериодРегистрации = &ДатаСобытия
		|	И ((БольничныйЛист.ЭлектронныйБольничный И &РежимЗаполнения=1)
		|		ИЛИ (НЕ БольничныйЛист.ЭлектронныйБольничный И &РежимЗаполнения=2)
		|		ИЛИ (&РежимЗаполнения=0))";
		Если ФСС = Перечисления.ВидыОбязательногоСтрахованияСотрудников.ФСС Тогда
			Текст = Текст + "	
			|	И НЕ БольничныйЛист.ПричинаНетрудоспособности В (&ПричинаНетрудоспособности)"
		Иначе	
			Текст = Текст + "	
			|	И БольничныйЛист.ПричинаНетрудоспособности В (&ПричинаНетрудоспособности)"
		КонецЕсли;
		Если СписокСотрудников <> Неопределено Тогда
			Текст = Текст + "
			|	И БольничныйЛист.Сотрудник В(&СписокСотрудников)";
		КонецЕсли;

		
	КонецЕсли;
	
	Возврат Текст;
	
КонецФункции 

Функция ОписаниеФиксацииРеквизитовЗаявленияВФССОВозмещенииВыплатРодителямДетейИнвалидов() Экспорт
	
	ОписаниеФиксацииРеквизитов = Новый Соответствие;
	
	// Сотрудники
	ОписаниеФиксацииРеквизитов.Вставить("НазваниеРабочегоОрганаФонда", 				ПрямыеВыплатыПособийСоциальногоСтрахованияБазовый.ОписаниеФиксацииРеквизитаЗаявленияВФССОВозмещенииВыплатРодителямДетейИнвалидов("НазваниеРабочегоОрганаФонда",		"Организация", "Организация", Ложь, , ""));
	ОписаниеФиксацииРеквизитов.Вставить("НомерФССУ",	 							ПрямыеВыплатыПособийСоциальногоСтрахованияБазовый.ОписаниеФиксацииРеквизитаЗаявленияВФССОВозмещенииВыплатРодителямДетейИнвалидов("НомерФССУ", 				"Организация", "Организация", Ложь, , ""));
	ОписаниеФиксацииРеквизитов.Вставить("НомерФСС",		 							ПрямыеВыплатыПособийСоциальногоСтрахованияБазовый.ОписаниеФиксацииРеквизитаЗаявленияВФССОВозмещенииВыплатРодителямДетейИнвалидов("НомерФСС", 				"Организация", "Организация", Ложь, , ""));
	ОписаниеФиксацииРеквизитов.Вставить("НомерФССНесчСлучай",						ПрямыеВыплатыПособийСоциальногоСтрахованияБазовый.ОписаниеФиксацииРеквизитаЗаявленияВФССОВозмещенииВыплатРодителямДетейИнвалидов("НомерФССНесчСлучай", 			"Организация", "Организация", Ложь, , ""));
	ОписаниеФиксацииРеквизитов.Вставить("КодПоЕДРПОУ",	 							ПрямыеВыплатыПособийСоциальногоСтрахованияБазовый.ОписаниеФиксацииРеквизитаЗаявленияВФССОВозмещенииВыплатРодителямДетейИнвалидов("КодПоЕДРПОУ", 				"Организация", "Организация", Ложь, , ""));
	ОписаниеФиксацииРеквизитов.Вставить("ГлавныйБухгалтер", 						ПрямыеВыплатыПособийСоциальногоСтрахованияБазовый.ОписаниеФиксацииРеквизитаЗаявленияВФССОВозмещенииВыплатРодителямДетейИнвалидов("ГлавныйБухгалтер",			"Организация", "Организация", Ложь, , ""));
	ОписаниеФиксацииРеквизитов.Вставить("ФИОДиректораФонда",						ПрямыеВыплатыПособийСоциальногоСтрахованияБазовый.ОписаниеФиксацииРеквизитаЗаявленияВФССОВозмещенииВыплатРодителямДетейИнвалидов("ФИОДиректораФонда",			"Организация", "Организация", Ложь, , ""));
	ОписаниеФиксацииРеквизитов.Вставить("КодКВЕД",		 							ПрямыеВыплатыПособийСоциальногоСтрахованияБазовый.ОписаниеФиксацииРеквизитаЗаявленияВФССОВозмещенииВыплатРодителямДетейИнвалидов("КодКВЕД", 				"Организация", "Организация", Ложь, , ""));
	ОписаниеФиксацииРеквизитов.Вставить("Руководитель", 							ПрямыеВыплатыПособийСоциальногоСтрахованияБазовый.ОписаниеФиксацииРеквизитаЗаявленияВФССОВозмещенииВыплатРодителямДетейИнвалидов("Руководитель", 				"Организация", "Организация", Ложь, , ""));
	ОписаниеФиксацииРеквизитов.Вставить("АдресОрганизации",							ПрямыеВыплатыПособийСоциальногоСтрахованияБазовый.ОписаниеФиксацииРеквизитаЗаявленияВФССОВозмещенииВыплатРодителямДетейИнвалидов("АдресОрганизации", 			"Организация", "Организация", Ложь, , ""));
	ОписаниеФиксацииРеквизитов.Вставить("ТелефонСоставителя",						ПрямыеВыплатыПособийСоциальногоСтрахованияБазовый.ОписаниеФиксацииРеквизитаЗаявленияВФССОВозмещенииВыплатРодителямДетейИнвалидов("ТелефонСоставителя", 			"Организация", "Организация", Ложь, , ""));
	
	//ОписаниеФиксацииРеквизитов.Вставить("ОплатыСотрудник", 							ПрямыеВыплатыПособийСоциальногоСтрахованияБазовый.ОписаниеФиксацииРеквизитаЗаявленияВФССОВозмещенииВыплатРодителямДетейИнвалидов("Сотрудник"));
	//ОписаниеФиксацииРеквизитов.Вставить("ОплатыСреднедневнойЗаработок", 			ПрямыеВыплатыПособийСоциальногоСтрахованияБазовый.ОписаниеФиксацииРеквизитаЗаявленияВФССОВозмещенииВыплатРодителямДетейИнвалидов("СреднедневнойЗаработок"));
	//ОписаниеФиксацииРеквизитов.Вставить("ОплатыКоличествоСтраниц", 					ПрямыеВыплатыПособийСоциальногоСтрахованияБазовый.ОписаниеФиксацииРеквизитаЗаявленияВФССОВозмещенииВыплатРодителямДетейИнвалидов("КоличествоСтраниц"));
	//ОписаниеФиксацииРеквизитов.Вставить("ОплатыСуммаПособия", 						ПрямыеВыплатыПособийСоциальногоСтрахованияБазовый.ОписаниеФиксацииРеквизитаЗаявленияВФССОВозмещенииВыплатРодителямДетейИнвалидов("СуммаПособия"));
	
	ОписаниеФиксацииРеквизитов.Вставить("ОплатыКоличествоДнейВсегоФСС", 			ПрямыеВыплатыПособийСоциальногоСтрахованияБазовый.ОписаниеФиксацииРеквизитаЗаявленияВФССОВозмещенииВыплатРодителямДетейИнвалидов("КоличествоДнейВсегоФСС"));
	ОписаниеФиксацииРеквизитов.Вставить("ОплатыСуммаПособияВсего", 			ПрямыеВыплатыПособийСоциальногоСтрахованияБазовый.ОписаниеФиксацииРеквизитаЗаявленияВФССОВозмещенииВыплатРодителямДетейИнвалидов("СуммаПособияВсего"));
	ОписаниеФиксацииРеквизитов.Вставить("ОплатыКоличествоДнейВсего", 			ПрямыеВыплатыПособийСоциальногоСтрахованияБазовый.ОписаниеФиксацииРеквизитаЗаявленияВФССОВозмещенииВыплатРодителямДетейИнвалидов("КоличествоДнейВсего"));
	ОписаниеФиксацииРеквизитов.Вставить("ОплатыСуммаПособияВсегоФСС", 			ПрямыеВыплатыПособийСоциальногоСтрахованияБазовый.ОписаниеФиксацииРеквизитаЗаявленияВФССОВозмещенииВыплатРодителямДетейИнвалидов("СуммаПособияВсегоФСС"));
	ОписаниеФиксацииРеквизитов.Вставить("ОплатыСуммаЛьготыЧернобыльцы", 			ПрямыеВыплатыПособийСоциальногоСтрахованияБазовый.ОписаниеФиксацииРеквизитаЗаявленияВФССОВозмещенииВыплатРодителямДетейИнвалидов("СуммаЛьготыЧернобыльцы"));
	
	//ОписаниеФиксацииРеквизитов.Вставить("ПособияНаПогребениеСотрудник", 			ПрямыеВыплатыПособийСоциальногоСтрахованияБазовый.ОписаниеФиксацииРеквизитаЗаявленияВФССОВозмещенииВыплатРодителямДетейИнвалидов("Сотрудник",				"ПособияНаПогребение", , , ,"ПособияНаПогребение"));
	//ОписаниеФиксацииРеквизитов.Вставить("ПособияНаПогребениеДокументОснование", 	ПрямыеВыплатыПособийСоциальногоСтрахованияБазовый.ОписаниеФиксацииРеквизитаЗаявленияВФССОВозмещенииВыплатРодителямДетейИнвалидов("ДокументОснование",			"ПособияНаПогребение", , , ,"ПособияНаПогребение"));
	ОписаниеФиксацииРеквизитов.Вставить("ПособияНаПогребениеРазмерПособия", 		ПрямыеВыплатыПособийСоциальногоСтрахованияБазовый.ОписаниеФиксацииРеквизитаЗаявленияВФССОВозмещенииВыплатРодителямДетейИнвалидов("РазмерПособия",				"ПособияНаПогребение", , , ,"ПособияНаПогребение"));	
	
	
	Возврат Новый ФиксированноеСоответствие(ОписаниеФиксацииРеквизитов);
	
КонецФункции 

Функция ИспользуетсяЗаполнениеДокументаЗаявлениеРасчетВФСС() Экспорт

	Возврат Истина;
	
КонецФункции 

#КонецОбласти

Функция ДанныеЗаполненияРасходовНаПогребение(Месяц, ФондСоциальногоСтрахования, Организация, СписокСотрудников, Ссылка, ЕдиновременноеПособие = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Текст = ТекстЗапросаПервичныеДокументыДляЗаполненияРасходовНаПогребение(ЕдиновременноеПособие, СписокСотрудников);
	Текст = Текст +
	"
	|; 
	|";
	
	Текст = Текст +
	"ВЫБРАТЬ
	|	ЕдиновременноеПособиеЗаСчетФСС.Сотрудник КАК Сотрудник,
	|	ЕдиновременноеПособиеЗаСчетФСС.Начислено КАК РазмерПособия,
	|	ЕдиновременноеПособиеЗаСчетФСС.Ссылка КАК ДокументОснование,
	|   ВЫБОР
	|   	КОГДА ЕдиновременноеПособиеЗаСчетФСС.ВидПособия = ЗНАЧЕНИЕ(Перечисление.ПереченьПособийСоциальногоСтрахования.ВСвязиСоСмертью) И НЕ ЕдиновременноеПособиеЗаСчетФСС.ПособиеНаПогребениеСотруднику
	|        ТОГДА ИСТИНА
	|        ИНАЧЕ ЛОЖЬ
	|   КОНЕЦ КАК ПособиеСтороннемуЛицу,
	|   ВЫБОР
	|   	КОГДА ЕдиновременноеПособиеЗаСчетФСС.ВидПособия = ЗНАЧЕНИЕ(Перечисление.ПереченьПособийСоциальногоСтрахования.ВСвязиСоСмертью) И НЕ ЕдиновременноеПособиеЗаСчетФСС.ПособиеНаПогребениеСотруднику
	|        ТОГДА ЕдиновременноеПособиеЗаСчетФСС.ФизическоеЛицо
	|        ИНАЧЕ НЕОПРЕДЕЛЕНО
	|   КОНЕЦ КАК СтороннееЛицо
	|ИЗ
	|	Документ.ЕдиновременноеПособиеЗаСчетФСС КАК ЕдиновременноеПособиеЗаСчетФСС
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТДокументы КАК ВТДокументы
	|		ПО ЕдиновременноеПособиеЗаСчетФСС.Ссылка = ВТДокументы.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Сотрудник";
	Запрос.Текст = Текст;
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ФондСоциальногоСтрахования", ФондСоциальногоСтрахования);
	Запрос.УстановитьПараметр("ДатаСобытия", Месяц);
	Запрос.УстановитьПараметр("Ссылка", Ссылка); 	
	Запрос.УстановитьПараметр("ДокументОснование", ЕдиновременноеПособие);
	Запрос.УстановитьПараметр("СписокСотрудников", СписокСотрудников);
	Возврат Запрос.Выполнить();
	
КонецФункции 

Функция ТекстЗапросаПервичныеДокументыДляЗаполненияРасходовНаПогребение(ЕдиновременноеПособие = Неопределено, СписокСотрудников)
	
	Если ЗначениеЗаполнено(ЕдиновременноеПособие) Тогда
		Текст = 
		"ВЫБРАТЬ
		|	ЕдиновременноеПособиеЗаСчетФСС.Ссылка
		|ПОМЕСТИТЬ ВТДокументы
		|ИЗ
		|	Документ.ЕдиновременноеПособиеЗаСчетФСС КАК ЕдиновременноеПособиеЗаСчетФСС
		|ГДЕ
		|	ЕдиновременноеПособиеЗаСчетФСС.Ссылка = &ДокументОснование";
	Иначе
		Текст = 
		"ВЫБРАТЬ
		|	ИспользованныеОплаты.ДокументОснование КАК Ссылка
		|ПОМЕСТИТЬ ВТИспользованныеОплаты
		|ИЗ
		|	Документ.ЗаявлениеРасчетВФСС.ПособияНаПогребение КАК ИспользованныеОплаты
		|ГДЕ
		|	ИспользованныеОплаты.Ссылка.Организация = &Организация
		|	И ИспользованныеОплаты.Ссылка <> &Ссылка
		|	И ИспользованныеОплаты.Ссылка.Проведен = ИСТИНА
		|	И НЕ ИспользованныеОплаты.Ссылка.ПометкаУдаления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕдиновременноеПособиеЗаСчетФСС.Ссылка
		|ПОМЕСТИТЬ ВТДокументы
		|ИЗ
		|	Документ.ЕдиновременноеПособиеЗаСчетФСС КАК ЕдиновременноеПособиеЗаСчетФСС
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТИспользованныеОплаты КАК ВТИспользованныеОплаты
		|		ПО ЕдиновременноеПособиеЗаСчетФСС.Ссылка = ВТИспользованныеОплаты.Ссылка
		|ГДЕ
		|	ЕдиновременноеПособиеЗаСчетФСС.Организация = &Организация
		|	И ЕдиновременноеПособиеЗаСчетФСС.ФондСоциальногоСтрахования = &ФондСоциальногоСтрахования
		|	И ВТИспользованныеОплаты.Ссылка ЕСТЬ NULL 
		|	И ЕдиновременноеПособиеЗаСчетФСС.ПометкаУдаления = ЛОЖЬ
		|	И ЕдиновременноеПособиеЗаСчетФСС.Проведен = ИСТИНА
		|	И ЕдиновременноеПособиеЗаСчетФСС.ПериодРегистрации = &ДатаСобытия
		|	И ЕдиновременноеПособиеЗаСчетФСС.Начислено > 0";
		Если СписокСотрудников <> Неопределено Тогда
		Текст = Текст + "
		|	И ЕдиновременноеПособиеЗаСчетФСС.Сотрудник В(&СписокСотрудников)";
		КонецЕсли;
	КонецЕсли;
	
	Возврат Текст;
	
КонецФункции 




// Определяет есть ли в массиве начислений пособия оплачиваемые за счет ФСС 
//
// Параметры
//  МассивНачислений - массив или список значений содержащий виды расчетов
//
// Возвращаемое значение:
//    Булево - истина, если в массиве начислений есть пособия за счет ФСС.
//
Функция КоллекцияСодержитПособияЗаСчетФСС(МассивНачислений) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Начисления.Ссылка
	|ИЗ
	|	ПланВидовРасчета.Начисления КАК Начисления
	|ГДЕ
	|	Начисления.Ссылка В(&МассивНачислений)
	|	И Начисления.КатегорияНачисленияИлиНеоплаченногоВремени В(&МассивКатегорий)";
	Запрос.УстановитьПараметр("МассивНачислений", МассивНачислений);
	Запрос.УстановитьПараметр("МассивКатегорий", ПрямыеВыплатыПособийСоциальногоСтрахования.КатегорииНачисленийПособийПоПрямымВыплатамФСС());
	Результат = Запрос.Выполнить();
	
	Возврат Не Результат.Пустой();	
	
КонецФункции

#КонецОбласти
